eisup_2019_docmng_integration/src/DataProcessors/абс_ПроверкаНеЗакрытыхЗадач/абс_ПроверкаНеЗакрытыхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ПроверкаНеЗакрытыхЗадач</name>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>ЗадачаВТехподдержку</name>
      <type>
        <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОтложенныеЗадачиПоПроверкиЗаяков/абс_ОтложенныеЗадачиПоПроверкиЗаяков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОтложенныеЗадачиПоПроверкиЗаяков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОтложенноВСекундах</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыЗаявокВПоддержку/абс_СтатусыЗаявокВПоддержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокВПоддержку</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>АнализДирМФС</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>ТестированиеДирМФС</name>
  </enumValues>
  <enumValues>
    <name>ТестированиеИнициатором</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеРабочегоПриложения</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаТестирования</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетТестирования</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЧТЗ</name>
  </enumValues>
  <enumValues>
    <name>КонтрольАрхитектуры</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗадачаВТехподдержку/абс_ЗадачаВТехподдержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗадачаВТехподдержку</name>
  <posting>Deny</posting>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключенаВПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.абс_ТипЗаявкиВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаИсполнителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияПроблемы</name>
    <type>
      <types>CatalogRef.абс_КлассификацияПроблемСопровождения</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделСопровождения</name>
    <type>
      <types>CatalogRef.абс_РазделыСопровождения</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.абс_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НезавершеннаяЗаявка</name>
    <type>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажноДляДирМФС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыйСтатус</name>
    <comment>Заполняется когда заявка переходит в статус «уточнение»</comment>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажностьЗаявки</name>
    <type>
      <types>EnumRef.абс_ВажностьЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляИсполнителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.абс_ЗадачиДляЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоннаяКонсультация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозможногоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДополнительногоСогласования</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДляКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееВыполнениеСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозникновенияЗаявок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СинонимПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/DataProcessors/абс_ПроверкаНеЗакрытыхЗадач/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Принять(Команда)
	
	Обработки.абс_ПроверкаНеЗакрытыхЗадач.Создать().ЗаписьВРегистр(ОтложитьНаВремя);
	ЭтаФорма.Закрыть(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьНаВремяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтложитьНаВремя.СписокВыбора.Очистить();
	Элементы.ОтложитьНаВремя.СписокВыбора.Добавить("30 мин.");
	Элементы.ОтложитьНаВремя.СписокВыбора.Добавить("Один час");
	Элементы.ОтложитьНаВремя.СписокВыбора.Добавить("Два часа");
	
КонецПроцедуры

&НаКлиенте
Процедура Закрытьформу(Команда)
	
	ЭтаФорма.Закрыть(0);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат = Новый ТаблицаЗначений;
	ОбновитьНаСервере(Результат);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(Результат = Неопределено)
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.ТестированиеИнициатором);
	Массив.Добавить(Перечисления.абс_СтатусыЗаявокВПоддержку.Уточнение);
	
	ДатаКонтроля = ТекущаяДата();
	Пользователь = глЗначениеПеременной("глТекущийПользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроверкиЗаяков.Пользователь КАК Пользователь,
	               |	ЕСТЬNULL(РАЗНОСТЬДАТ(&ТекущаяДата, ПроверкиЗаяков.ОтложенноВСекундах, СЕКУНДА), 0) КАК Время
	               |ПОМЕСТИТЬ пр
	               |ИЗ
	               |	РегистрСведений.абс_ОтложенныеЗадачиПоПроверкиЗаяков.СрезПоследних(, Пользователь = &Пользователь) КАК ПроверкиЗаяков
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	абс_ЗадачаВТехподдержку.Ссылка КАК ЗадачаВТехподдержку,
	               |	абс_ЗадачаВТехподдержку.Статус КАК ТекущийСтатус,
	               |	абс_ЗадачаВТехподдержку.Инициатор КАК Инициатор,
	               |	ЕСТЬNULL(пр.Время, 0) КАК Время
	               |ПОМЕСТИТЬ вр
	               |ИЗ
	               |	пр КАК пр
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.абс_ЗадачаВТехподдержку КАК абс_ЗадачаВТехподдержку
	               |		ПО пр.Пользователь = абс_ЗадачаВТехподдержку.Инициатор
	               |ГДЕ
	               |	(НЕ абс_ЗадачаВТехподдержку.ПометкаУдаления)
	               |	И абс_ЗадачаВТехподдержку.Инициатор = &Пользователь
	               |	И абс_ЗадачаВТехподдержку.Статус В(&Статус)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗадачаВТехподдержку,
	               |	Инициатор,
	               |	ТекущийСтатус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	вр.ЗадачаВТехподдержку,
	               |	вр.ТекущийСтатус,
	               |	вр.Инициатор,
	               |	вр.Время
	               |ИЗ
	               |	вр КАК вр
	               |ГДЕ
	               |	вр.Время <= 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ вр";
				   
	Запрос.УстановитьПараметр("Статус",Массив);	
	Запрос.УстановитьПараметр("ТекущаяДата",ДатаКонтроля);
	Запрос.УстановитьПараметр("Пользователь"  ,Пользователь);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		
		 Объект.СписокЗадач.Загрузить(Результат);
		 		 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗадачаВТехподдержку = Элемент.ТекущиеДанные.ЗадачаВТехподдержку;
	Если ЗначениеЗаполнено(ЗадачаВТехподдержку) Тогда
		П = Новый Структура("Ключ", ЗадачаВТехподдержку);
		Ф = ПолучитьФорму("Документ.абс_ЗадачаВТехподдержку.ФормаОбъекта", П);
		Ф.Открыть();	
	КонецЕсли;	
	
КонецПроцедуры
